avt = {
    "Автосалон": {
        "Подчиненные": {
            "Младший маркетолог": {
                                  "name": "Рома",
                                  "age": 40,
                                  "stag": 15,
                                  "З/П": 10000,
                                  "podch": ["Директор автосалона", "Старший маркетолог"]
                                  },
            "Кассир": {
                                  "name": "Дмитрий",
                                  "age": 20,
                                  "stag": 3,
                                  "З/П": 20000,
                                  "podch": ["Директор автосалона", "Начальник отдела продаж"]
                                 },
            "Менеджер по выдаче кредита": {
                                  "name": "Мария",
                                  "age": 35,
                                  "stag": 6,
                                  "З/П": 50000,
                                  "podch": ["Директор автосалона", "Начальник отдела продаж"]
                                         },
            "Менеджер по работе с клиентами": {
                                  "name": "Иван",
                                  "age": 22,
                                  "stag": 6,
                                  "З/П": 50000,
                                  "podch": ["Директор автосалона", "Начальник отдела продаж"]
                                             },
            "Младший бухгалтер": {
                                  "name": "Лина",
                                  "age": 56,
                                  "stag": 24,
                                  "З/П": 30000,
                                  "podch": ["Директор автосалона", "Старший бухгалтер"]
                                            }},
        "Руководители": {
            "Директор автосалона": {
                     "name": "Андрей",
                     "age": 55,
                     "stag": 10,
                     "З/П": 100000,
                     "rukovodit": ["Младший маркетолог", "Кассир", "Менеджер по выдаче кредита",
                      "Менеджер по работе с клиентами", "Младший бухгалтер", "Начальник отдела продаж",
                      "Старший бухгалтер", "Старший маркетолог"]
            }
        },
            "Начальство": {
                     "Начальник отдела продаж": {
                         "name": "Петр",
                         "age": 32,
                         "stag": 7,
                         "З/П": 80000,
                         "rukovodit": ["Кассир", "Менеджер по выдаче кредитов",
                                      "Менеджер по работе с клиентами"]
                     },
                     "Старший бухгалтер": {
                         "name": "Настя",
                         "age": 43,
                         "stag": 11,
                         "З/П": 60000,
                         "rukovodit": ["Младший бухгалтер"]},
                     "Старший маркетолог": {
                         "name": "Михаил",
                         "age": 65,
                         "stag": 12,
                         "З/П": 75000,
                         "rukovodit": ["Младший маркетолог"]
                     }
                 },

            "Отделения": {
                     "Бухгалтерия": {
                         "personal": ["Младший бухгалтер", "Страший бухгалтер"]
                     },
                     "Отдел продаж": {
                         "personal": ["Кассир", "Менеджер по выдаче кредита",
                                     "Менеджер по работе с клиентами", "Начальник отдела продаж"]
                     },
                     "Отдел маркетинга": {
                         "personal": {"Младший маркетолог", "Страший маркетолог"}
                     }
                 },

                }
       }

def rs(n):
    for key,value in n[1].items():
        print(key, ':', value)

def nm(name):
    for i in avt.items():
        for m in i[1].items():
            for k in m[1].items():
                for p in k[1].items():
                        if name in p:
                            fnd_otd(k[0])
                            print(k[0])
                            rs(k)

def for_num(part,cond,col):
    for i in avt.items():
        for m in i[1].items():
            for k in m[1].items():
                for p in k[1].items():
                    if part in p:
                        if cond == "more":
                            if p[1] > col:
                                fnd_otd(k[0])
                                rs(k)
                        elif cond == "min":
                            if p[1] < col:
                                fnd_otd(k[0])
                                rs(k)
                        elif cond == "eql":
                            if p[1] == col:
                                fnd_otd(k[0])
                                rs(k)

def rk_pod(dols,dols_name):
    for i in avt.items():
            for m in i[1].items():
                for k in m[1].items():
                    for p in k[1].items():
                        if dols in p:
                            if dols_name in p[1]:
                                fnd_otd(k[0])
                                print(k[0])
                                rs(k)

def fnd_otd(dlsn):
    for i in avt.items():
        for m in i[1].items():
            if "Отделения" == m[0]:
                for y in m[1].items():
                    for l in y[1].items():
                        if dlsn in l[1]:
                            print(y[0])

def main():
    v = int(input("Выберите позицию для поиска\n1)nm = поиск по имени\n2)for_num = поиск по: возрасту, стажу, З/П\n"
                  "3)rk_pod = поиск по должности\n4)fnd_otd = поиск по отделам\nВведите выбор = "))

    if v == 1:
        nm(name = input("Введите имя, чтобы узнать информацию о сотруднике\n>>> "))
    elif v == 2:
        for_num(part = input("Введите по какому критерию хотите искать\n1)age\n2)stage\n3)З/П\n>>> "),
                cond = input("more = больше чем\nmin = меньше чем\neql = равно\n>>> "),
                col = int(input("Введите число в зависимости от выбранного критерия\n>>> ")))
    elif v == 3:
        rk_pod(dols = input("1)podch = список кто подчиняется #\n2)rukovodit = список кто руководит #\n>>> "),
               dols_name = input("Введите должность\n>>> "))
    elif v == 4:
        fnd_otd(dlsn = input("Ведите должность\n>>> "))

main()
